<a href="https://colab.research.google.com/github/jishnumehta360/Pyspark-beginning/blob/main/DataOperations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.12/dist-packages (3.5.1)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.12/dist-packages (from pyspark) (0.10.9.7)

In [4]:
import pyspark as py
import pandas as pd
import numpy as np
!apt-get install openjdk-8-jdk-headless -qq > /dev/null
from pyspark.sql import SparkSession

In [7]:
spark = SparkSession.builder.appName("Operations").getOrCreate()

In [8]:
spark

In [13]:
#Reading the schema with appropriate datatypes
df_spark = spark.read.option('header','true').csv('/content/sample_data/test1.csv',inferSchema=True)
df_spark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [25]:
df_spark_1 = spark.read.csv('/content/sample_data/test1.csv',header=True,inferSchema=True)
df_spark_1.show()
df_spark_1.columns

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [34]:
df_spark_1.head(3)
df_spark_1.select('Name','Experience').show()
df_spark_1.dtypes
df_spark_1.describe()

+---------+----------+
|     Name|Experience|
+---------+----------+
|    Krish|        10|
|Sudhanshu|         8|
|    Sunny|         4|
|     Paul|         3|
|   Harsha|         1|
|  Shubham|         2|
+---------+----------+

DataFrame[summary: string, Name: string, age: string, Experience: string, Salary: string]

In [37]:
##Adding Columns

df_spark_2 = df_spark_1.withColumn('Experience After 2 years',df_spark_1['Experience']+2)
df_spark_2.show()

+---------+---+----------+------+------------------------+
|     Name|age|Experience|Salary|Experience After 2 years|
+---------+---+----------+------+------------------------+
|    Krish| 31|        10| 30000|                      12|
|Sudhanshu| 30|         8| 25000|                      10|
|    Sunny| 29|         4| 20000|                       6|
|     Paul| 24|         3| 20000|                       5|
|   Harsha| 21|         1| 15000|                       3|
|  Shubham| 23|         2| 18000|                       4|
+---------+---+----------+------+------------------------+

In [38]:
##Dropping Columns

df_spark_3 = df_spark_2.drop('Experience After 2 years')
df_spark_3.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [39]:
##Renameing Columns
df_spark_4 = df_spark_3.withColumnRenamed('Name','New Name')
df_spark_4.show()

+---------+---+----------+------+
| New Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+